Revit 2027 API
MEPAnalyticalSystem.AnalyticalSystemDomain Property
 The type of analytical system.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AnalyticalSystemDomain AnalyticalSystemDomain { get; }
Public ReadOnly Property AnalyticalSystemDomain As AnalyticalSystemDomain
	Get
public:
property AnalyticalSystemDomain AnalyticalSystemDomain {
	AnalyticalSystemDomain get ();
}
member AnalyticalSystemDomain : AnalyticalSystemDomain with get
Property Value
AnalyticalSystemDomain
See Also
Reference
MEPAnalyticalSystem Class
Autodesk.Revit.DB.Mechanical Namespace